; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph0 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation7 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation6 - direction
	Star2 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(have_image Planet10 thermograph0)
	(have_image Phenomenon11 thermograph0)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (turn_to satellite0 phenomenon11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon11)
   goals met: 0 of 4
3. (turn_to satellite0 star2 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star2)
   goals met: 0 of 4
4. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 4
5. (turn_to satellite0 phenomenon11 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon11)
   goals met: 0 of 4
6. (take_image satellite0 phenomenon11 instrument0 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 1 of 4
7. (turn_to satellite0 planet10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet10)
   goals met: 1 of 4
8. (take_image satellite0 planet10 instrument0 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 2 of 4
9. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 2 of 4
10. (take_image satellite0 planet12 instrument0 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 3 of 4
11. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 3 of 4
12. (take_image satellite0 planet13 instrument0 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 4 of 4
